CommunityGD32Cores/gigadevice-firmware-and-docs/GD32F10x/GD32F10x_Firmware_Library_V2.2.2/Examples/USBFS/USB_Device/audio/src/gd32f10x_audio_codec.c
#ifdef AUDIO_MAL_DMA_IT_TE_EN
    /* FIFO Error interrupt */
    if ((DMA_GetFlagStatus(AUDIO_MAL_DMA_STREAM, AUDIO_MAL_DMA_FLAG_TE) != RESET) || \
        (DMA_GetFlagStatus(AUDIO_MAL_DMA_STREAM, AUDIO_MAL_DMA_FLAG_FE) != RESET) || \
        (DMA_GetFlagStatus(AUDIO_MAL_DMA_STREAM, AUDIO_MAL_DMA_FLAG_DME) != RESET)) {
       /* manage the error generated on DMA FIFO: This function 
          should be coded by user (its prototype is already declared in gd32f10x_audio_codec.h) */  
        eval_audio_error_callback((uint32_t*)&addr);

        /* clear the interrupt flag */
        DMA_ClearFlag(AUDIO_MAL_DMA_STREAM, AUDIO_MAL_DMA_FLAG_TE | AUDIO_MAL_DMA_FLAG_FE | \
                      AUDIO_MAL_DMA_FLAG_DME);
    }
#endif /* AUDIO_MAL_DMA_IT_TE_EN */
}

/* PCM1770 audio codec control functions */

/*!
    \brief      initializes the audio codec and all related interfaces (control 
                interface: i2c and audio interface: i2s)
    \param[in]  output_device:
      \arg        OUTPUT_DEVICE_SPEAKER
      \arg        OUTPUT_DEVICE_HEADPHONE
      \arg        OUTPUT_DEVICE_BOTH
      \arg        OUTPUT_DEVICE_AUTO
    \param[in]  volume: initial volume level (from 0 (mute) to 100 (max))
    \param[in]  audiofreq: audio frequency used to play the audio stream
    \param[out] none
    \retval     0 if correct communication, else wrong communication
*/
uint32_t codec_init(uint16_t output_device, uint8_t volume, uint32_t audio_freq)
{
    uint32_t counter = 0;

    /* configure the codec related IOs */
    codec_gpio_init();

    /* reset the codec registers */
    codec_reset();

    /* initialize the control interface of the audio codec */
    codec_ctrl_interface_init();

    /* keep codec powered off */
    counter += codec_write_register(0x02, 0x01);

    switch (output_device) {
    case OUTPUT_DEVICE_SPEAKER:
        counter += codec_write_register(0x04, 0xFA); /* SPK always ON & HP always OFF */
        output_dev = 0xFA;
        break;
    case OUTPUT_DEVICE_HEADPHONE:
        counter += codec_write_register(0x04, 0xAF); /* SPK always OFF & HP always ON */
        output_dev = 0xAF;
        break;
    case OUTPUT_DEVICE_BOTH:
        counter += codec_write_register(0x04, 0xAA); /* SPK always ON & HP always ON */
        output_dev = 0xAA;
        break;
    case OUTPUT_DEVICE_AUTO:
        counter += codec_write_register(0x04, 0x05); /* detect the HP or the SPK automatically */
        output_dev = 0x05;
        break;
    default:
        counter += codec_write_register(0x04, 0x05); /* detect the HP or the SPK automatically */
        output_dev = 0x05;
        break;
    }

    /* clock configuration: auto detection */
    counter += codec_write_register(0x05, 0x81);

    /* set the slave mode and the audio standard */
    counter += codec_write_register(0x06, CODEC_STANDARD);

    /* set the master volume */
    codec_volume_ctrl(volume);

    /* if the Speaker is enabled, set the Mono mode and volume attenuation level */
    if (output_device != OUTPUT_DEVICE_HEADPHONE) {
        /* Set the Speaker Mono mode */
        counter += codec_write_register(0x0F , 0x06);

        /* Set the Speaker attenuation level */
        counter += codec_write_register(0x24, 0x00);
        counter += codec_write_register(0x25, 0x00);
    }

    /* power on the codec */
    counter += codec_write_register(0x02, 0x9E);

    /* Additional configuration for the CODEC. These configurations are done to reduce
       the time needed for the Codec to power off. If these configurations are removed,
       then a long delay should be added between powering off the Codec and switching
       off the I2S peripheral MCLK clock (which is the operating clock for Codec).
       If this delay is not inserted, then the codec will not shut down properly and
       it results in high noise after shut down. */

    /* disable the analog soft ramp */
    counter += codec_write_register(0x0A, 0x00);

    /* disable the digital soft ramp */
    counter += codec_write_register(0x0E, 0x04);

    /* disable the limiter attack level */
    counter += codec_write_register(0x27, 0x00);

    /* adjust bass and treble levels */
    counter += codec_write_register(0x1F, 0x0F);

    /* adjust pcm volume level */
    counter += codec_write_register(0x1A, 0x0A);
    counter += codec_write_register(0x1B, 0x0A);

    /* configure the i2s peripheral */
    codec_audio_interface_init(audio_freq);

    /* return communication control value */
    return counter;
}

/*!
    \brief      restore the audio codec state to default state and free all used resources
    \param[in]  none
    \param[out] none
    \retval     0 if correct communication, else wrong communication
*/
uint32_t codec_deinit(void)
{
    uint32_t counter = 0;

    /* reset the codec registers */
    codec_reset();

    /* keep codec powered off */
    counter += codec_write_register(0x02, 0x01);

    /* deinitialize all use IOs */
    codec_gpio_deinit();

    /* disable the codec control interface */
    codec_ctrl_interface_deinit();

    /* deinitialize the codec audio interface (i2s) */
    codec_audio_interface_deinit();

    /* return communication control value */
    return counter;
}

/*!
    \brief      start the audio codec play feature
                for this codec no play options are required
    \param[in]  none
    \param[out] none
    \retval     0 if correct communication, else wrong communication
*/
uint32_t codec_play(void)
{
    /* no actions required on codec level for play command */

    /* return communication control value */
    return 0;
}

/*!
    \brief      pauses and resumes playing on the audio codec
    \param[in]  cmd: AUDIO_PAUSE (or 0) to pause, AUDIO_RESUME (or any value different
                from 0) to resume
    \param[out] none
    \retval     0 if correct communication, else wrong communication
*/
uint32_t codec_pause_resume(uint32_t cmd)
{
    uint32_t counter = 0;

    /* pause the audio file playing */
    if (cmd == AUDIO_PAUSE) {
        /* mute the output first */
        counter += codec_mute(AUDIO_MUTE_ON);

        /* put the codec in power save mode */
        counter += codec_write_register(0x02, 0x01);
    } else {
        /* unmute the output first */
        counter += codec_mute(AUDIO_MUTE_OFF);

